month = int(input('Введите месяц года от 1 до 12: '))
month_dict = {
    1: 'Январь',
    2: "Февраль",
    3: "Март",
    4: "Апрель",
    5: "Май",
    6: "Июнь",
    7: "Июль",
    8: "Август",
    9: "Сентябрь",
    10: "Октябрь",
    11: "Ноябрь",
    12: "Декабрь"
}
month_list = ["Зима", "Зима",
              "Весна", "Весна", "Весна",
              "Лето", "Лето", "Лето",
              "Осень", "Осень", "Осень",
              "Зима"]
if month in month_dict:
    print(f"{month}-й месяц года - это {month_dict[month]}")
    print(f"{month_dict[month]} - это {month_list[month-1]}")
else:
    print("Ошибочка с месяцем")
